УТ_для_edt/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/CRM_СинхронизацияСМобильнымПриложениемНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="df0549ff-2ca6-4f11-ab58-449d09e1906e">
  <name>CRM_СинхронизацияСМобильнымПриложениемНовый</name>
  <comment>Не затягивать из CRM3!</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УТ_для_edt/src/InformationRegisters/ПравилаДляОбменаДанными/ПравилаДляОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаДляОбменаДанными</name>
  <resources>
    <name>ИмяМакетаПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяМакетаПравилКорреспондента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПланаОбменаИзПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаОбработкиДляОтладкиВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаОбработкиДляОтладкиЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПротоколаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОПравилах</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПравил</name>
    <type>
      <types>EnumRef.ИсточникиПравилДляОбменаДанными</types>
    </type>
  </resources>
  <resources>
    <name>НеОстанавливатьПоОшибке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаXMLКорреспондента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаЗачитанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаЗачитанныеКорреспондента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладкиВыгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладкиЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПротоколированияОбменаДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИспользоватьФильтрВыборочнойРегистрацииОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаЗагружены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПравил</name>
    <type>
      <types>EnumRef.ВидыПравилДляОбменаДанными</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена	= Ложь;
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса 				= Ложь;
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки	= Ложь;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	//ОписаниеВарианта.ПутьКФайлуКомплектаПравилНаПользовательскомСайте	= "https://users.v8.1c.ru/distribution/project/EnterpriseERP20";
	//ОписаниеВарианта.ПутьКФайлуКомплектаПравилВКаталогеШаблонов			= "\1c\enterprise";
	//ОписаниеВарианта.ИмяФайлаНастроекДляПриемника						= НСтр("ru='Синхронизация данных через универсальный формат';en='Data synchronization via universal format'");
	//ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными			= ИспользоватьПомощникСозданияОбменаДанными();
	//ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена				= ИспользуемыеТранспортыСообщенийОбмена();
	//ОписаниеВарианта.КраткаяИнформацияПоОбмену							= КраткаяИнформацияПоОбмену(ИдентификаторНастройки);
	//ОписаниеВарианта.ПодробнаяИнформацияПоОбмену						= ПодробнаяИнформацияПоОбмену(ИдентификаторНастройки);
	//ОписаниеВарианта.ЗначенияПоУмолчанию								= ЗначенияПоУмолчаниюНаУзле(ИдентификаторНастройки);
	//ОписаниеВарианта.ЗначенияПоУмолчаниюКорреспондента					= ЗначенияПоУмолчаниюНаУзлеБазыКорреспондента(ИдентификаторНастройки);
	//ОписаниеВарианта.Отборы												= НастройкаОтборовНаУзле(ИдентификаторНастройки);
	//ОписаниеВарианта.ОтборыКорреспондента           					= НастройкаОтборовНаУзлеБазыКорреспондента(ИдентификаторНастройки);
	//
	//Если ИдентификаторНастройки = "ОбменУниверсальный" Тогда
	//	
	//	ОписаниеВарианта.Вставить("ЗаголовокКомандыДляСозданияНовогоОбменаДанными", НСтр("ru='Другая программа';en='Another application'"));
	//	ОписаниеВарианта.Вставить("ЗаголовокПомощникаСозданияОбмена",               НСтр("ru='Настройка синхронизации данных через универсальный формат';en='Set up data synchronization using a universal format'"));
	//	ОписаниеВарианта.Вставить("ЗаголовокУзлаПланаОбмена",                       НСтр("ru='Синхронизация данных через универсальный формат';en='Data synchronization via universal format'"));
	//	ОписаниеВарианта.Вставить("НаименованиеКонфигурацииКорреспондента",         НСтр("ru='Другая программа';en='Another application'"));
	//	
	//Иначе
	//	
	//	ОписаниеВарианта.Вставить("НаименованиеКонфигурацииКорреспондента",         НСтр("ru='Через универсальный формат обмена';en='Via universal exchange format'"));
	//	
	//КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПравилаРегистрации(Параметры = Неопределено) Экспорт
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда Возврат КонецЕсли;
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИмяПланаОбмена",  "CRM_СинхронизацияСМобильнымПриложениемНовый");
	СтруктураЗаписи.Вставить("ВидПравил",       Перечисления.ВидыПравилДляОбменаДанными.ПравилаРегистрацииОбъектов);
	СтруктураЗаписи.Вставить("ИмяМакетаПравил", "ПравилаРегистрации");
	СтруктураЗаписи.Вставить("ИсточникПравил",  Перечисления.ИсточникиПравилДляОбменаДанными.МакетКонфигурации);
	СтруктураЗаписи.Вставить("ИспользоватьФильтрВыборочнойРегистрацииОбъектов", Истина);
	
	// Получаем набор записей регистра.
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, "ПравилаДляОбменаДанными");
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	// Загружаем правила для обмена данными в ИБ.
	Отказ = Ложь;
	РегистрыСведений.ПравилаДляОбменаДанными.ЗагрузитьПравила(Отказ, НаборЗаписей[0]);
	
	Если Не Отказ Тогда
		НаборЗаписей.Записать();
		ОбменДаннымиСлужебный.ОбновитьКэшМеханизмаРегистрацииОбъектов();
	КонецЕсли;
	
КонецПроцедуры	

Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра)
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
КонецФункции

#КонецОбласти

#КонецЕсли
